БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/РедактированиеКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеКонтактнойИнформации</name>
  <comment>Служит для редактирования контактной информации</comment>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <comment>Тип</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <comment>Вид</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <comment>Представление</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле1</name>
    <comment>Поле 1 </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле2</name>
    <comment>Поле 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле3</name>
    <comment>Поле 3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле4</name>
    <comment>Поле 4</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле5</name>
    <comment>Поле 5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле6</name>
    <comment>Поле 6</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле7</name>
    <comment>Поле 7</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле8</name>
    <comment>Поле 8</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле9</name>
    <comment>Поле 9</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьВРегистр</name>
    <comment>Записывать в регистр</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле10</name>
    <comment>Поле 10</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле11</name>
    <comment>Поле 11</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле12</name>
    <comment>Поле 12</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьОбъекта</name>
    <comment>Доступность объекта</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Признак значения по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <comment>Вспомогательное поле: &quot;Код страны&quot; или &quot;Индекс&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <comment>Вспомогательное поле: &quot;Код города&quot; или &quot;Регион&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <comment>Вспомогательное поле: &quot;Номер телефона&quot; или &quot;Район&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <comment>Вспомогательное поле: &quot;Внутренний (или добавочный)  номер&quot; или &quot;Город&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <comment>Вспомогательное поле: &quot;Населенный пункт&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <comment>Вспомогательное поле: &quot;Улица&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <comment>Вспомогательное поле: &quot;Дом&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <comment>Вспомогательное поле: &quot;Корпус&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <comment>Вспомогательное поле: &quot;Квартира&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <comment>Строковое представление контактной информации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <comment>Вспомогательное поле: &quot;Подъезд&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле11</name>
    <comment>Вспомогательное поле: &quot;Этаж&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле12</name>
    <comment>Вспомогательное поле: &quot;Код двери/домофон&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец контактной информации</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <comment>Вид контактной информации</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/Forms/ФормаДереваВидовУпр/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда 
		Объект.Объект = Параметры.Объект;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Объект) Тогда
		Отказ = Истина;
		
		РаботаСФормамиСервер.ЗапретИнтерактивногоОткрытия(Отказ);
	Иначе
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " ["+ЭтаФорма.Объект.Объект.ПолучитьОбъект().Наименование+"]";
	КонецЕсли;	
	
	СформироватьДеревоВидовКИ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ТолстыйКлиент Тогда
		ТолькоПредопределенные = ВосстановитьЗначение("ТолькоПредопределенные");
	#КонецЕсли
	
	Элементы.ДеревоВидов.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ВидКонтактнойИнформацииИзменение" Тогда
		СформироватьДеревоВидовКИ();
		Для Каждого СтрокаВерхнегоУровня Из ДеревоВидов.ПолучитьЭлементы() Цикл
			Элементы.ДеревоВидов.Развернуть(СтрокаВерхнегоУровня.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Если Элементы.ДеревоВидов.ТекущаяСтрока <> Неопределено Тогда
		
		ТекущиеДанные = Элементы.ДеревоВидов.ТекущиеДанные.ВидыКонтактнойИнформации;
		Если ТипЗнч(ТекущиеДанные) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			ТекущийТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные, "Тип");
		Иначе
			ТекущийТип = ТекущиеДанные;
		КонецЕсли;	           
		
		Если ОбщегоНазначения.ЕстьПравоДоступа("Добавление", "Справочник.ВидыКонтактнойИнформации") Тогда
			ДобавитьВидКонтактнойИнформации(ТекущийТип);
		Иначе
			Предупреждение("Нет права на добавление новых видов контактной информации", 30);
		КонецЕсли;

	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВид(Команда)
	ПараметрыФормы = Новый Структура("Ключ", Элементы.ДеревоВидов.ТекущиеДанные.ВидыКонтактнойИнформации);
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДействиеВыбрать(Команда)
	
	Если Элементы.ДеревоВидов.ТекущиеДанные <> Неопределено Тогда
		ВыбранныйВидКИ = Элементы.ДеревоВидов.ТекущиеДанные.ВидыКонтактнойИнформации;
		Если ТипЗнч(ВыбранныйВидКИ) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			
			СтрокаФормы = КонтактнаяИнформацияСервер.ПолучитьСтрокуФормыПоВиду(ВыбранныйВидКИ);
			
			Если ЗначениеЗаполнено(СтрокаФормы) Тогда
				
				Если СтрокаФормы = "Обработка.РедактированиеКонтактнойИнформации.Форма.ФормаЗаписиАдресаУпр" Тогда
					
					ПараметрыОткрытия = Новый Структура;
					ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ВыбранныйВидКИ);
					ПараметрыОткрытия.Вставить("ЗначенияПолей",           
						КонтактнаяИнформацияСервер.ЗначенияПолейСГородомИзКэшаФилиала(Объект.Объект, ВыбранныйВидКИ, глКэшАдресовФилиалов));
					ПараметрыОткрытия.Вставить("Представление",           Неопределено);
					ПараметрыОткрытия.Вставить("Объект",				  Объект.Объект);
					
					Оповещение = Новый ОписаниеОповещения("ОбработкаОповещенияЗаполненияКИ", ЭтаФорма, Новый Структура("Объект", Объект.Объект));
					УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Неопределено, Оповещение);
					
				Иначе
					
					ЗначенияЗаполнения = Новый Структура;
					ЗначенияЗаполнения.Вставить("Вид", ВыбранныйВидКИ);
					ЗначенияЗаполнения.Вставить("Объект", Объект.Объект);
					ЗначенияЗаполнения.Вставить("Редактирование", Ложь);
					Закрыть();
					
					ОткрытьФорму(СтрокаФормы, Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
					
				КонецЕсли;
				
			ИначеЕсли СтрокаФормы = "" Тогда 
				ОткрытьФорму("РегистрСведений.КонтактнаяИнформация.ФормаЗаписи");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТолькоПредопределенныеПриИзменении(Элемент)
	СформироватьДеревоВидовКИ();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДействиеВыбрать(Неопределено)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДеревоВидовКИ()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК ВидКонтактнойИнформации,
	|	ВидыКонтактнойИнформации.Тип,
	|	ВЫБОР КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ТОГДА 3
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					ТОГДА 2
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)
	|							ТОГДА 7
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|									ТОГДА 4
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
	|											ТОГДА 5
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Картинка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|    НЕ ВидыКонтактнойИнформации.ПометкаУдаления
	|";
	
	Если ТолькоПредопределенные Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|И
		|    ВидыКонтактнойИнформации.Предопределенный
		|";
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.Тип) Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|И
		|    ВидыКонтактнойИнформации.Тип = &ТипКонтактнойИнформации
		|";
		Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Объект.Тип);
	КонецЕсли; 	
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИТОГИ ПО
	|	ВидыКонтактнойИнформации.Тип
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Дерево = ДанныеФормыВЗначение(ДеревоВидов, ТИп("ДеревоЗначений"));
	
	Дерево.Строки.Очистить();
	
	// Загрузка разных картинок для видов ки.
	киКартинки = ЗагрузитьКартинкиВХранилища();
	
	// КИ объекта.
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Установить(Объект.Объект);
	НаборЗаписейКИ.Прочитать();
	
	// Делаем перебор результата
	Пока Выборка.Следующий() Цикл
		Строка = Дерево.Строки.Добавить();
		Строка.ВидыКонтактнойИнформации = Выборка.Тип;
		ТекКартинка = киКартинки.Получить(Строка(Выборка.Тип));
		Строка.Картинка = ТекКартинка;
		ВыборкаВлож = Выборка.Выбрать();
		Пока ВыборкаВлож.Следующий() Цикл
			Если НЕ ВыборкаВлож.ВидКонтактнойИнформации = NULL Тогда
				// Если контактная информация данного вида ещё не была введена.
				Если КонтактнаяИнформацияСервер.КоличествоЗаписейКонтактнойИнформации(НаборЗаписейКИ, ВыборкаВлож.ВидКонтактнойИнформации) = 0 Тогда
					СтрокаВлож = Строка.Строки.Добавить();
					СтрокаВлож.ВидыКонтактнойИнформации = ВыборкаВлож.ВидКонтактнойИнформации;
					СтрокаВлож.Картинка = ТекКартинка;
				КонецЕсли;	
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;  
	
	ЗначениеВДанныеФормы(Дерево, ДеревоВидов);

КонецПроцедуры

&НаСервере
Функция ЗагрузитьКартинкиВХранилища()
	
	Соот = Новый Соответствие;
	Соот.Вставить("Адрес", ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КонтактнаяИнформацияАдрес));
	Соот.Вставить("Телефон",ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КонтактнаяИнформацияТелефон));		
	Соот.Вставить("Номер ICQ",ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КонтактнаяИнформацияICQ));						
	Соот.Вставить("E-Mail",ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КонтактнаяИнформацияЭлектроннаяПочта));										
	Соот.Вставить("Веб-страница",ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КонтактнаяИнформацияВебСтраница));
	Соот.Вставить("Skype",ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Skype));
	Соот.Вставить("Другое",ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КонтактнаяИнформацияДругое));				
	
	Возврат Соот;
	
КонецФункции	

// Добавляет новый вид контактной информации заданного типа.
&НаКлиенте
Процедура ДобавитьВидКонтактнойИнформации(Тип = Неопределено) 
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Тип, Наименование", Тип, Строка(Тип)));
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

// Обработка оповещения о заполнении КИ.
//
// Параметры:
//  Результат				 - Структура - описание записи контактной информации.
//  ДополнительныеПараметры	 - Структура - с обязательным полем "Объект" - ссылка на владельца КИ.
//
&НаКлиенте
Процедура ОбработкаОповещенияЗаполненияКИ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		//+бит
		ТипАдреса = "";
		ЧтениеЗначения = Новый ЧтениеJSON;
		ЧтениеЗначения.УстановитьСтроку(Результат.Значение);
		Пока ЧтениеЗначения.Прочитать() Цикл
			Тип = ЧтениеЗначения.ТипТекущегоЗначения;
			Если Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
				Если ЧтениеЗначения.ТекущееЗначение = "addressType" Тогда 
					ЧтениеЗначения.Прочитать();
					Тип = ЧтениеЗначения.ТипТекущегоЗначения;
					Если Тип = ТипЗначенияJSON.Строка Тогда 
						ТипАдреса = ЧтениеЗначения.ТекущееЗначение;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		Если ТипАдреса = "Административно-территориальный" Тогда
			Результат.Значение = "";
		КонецЕсли;
		КонтактнаяИнформацияСервер.ЗаписатьКонтактнуюИнформацию(ДополнительныеПараметры.Объект, Результат.Тип, Результат.Вид, Результат.КонтактнаяИнформация, Результат.Значение);  
		//-бит
		// Оповещение динамических списков контактной информации без основной таблицы об изменении данных.
		Оповестить("КонтактнаяИнформацияИзменение", ДополнительныеПараметры.Объект);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
